# Pandas

In [1]:
import pandas as pd

### 데이터 읽어오기
- pd.read_csv('file_path/data_name.csv')
- pd.read_txt('file_path/data_name.txt')
- pd.read_csv('file_path/data_name.txt', delimiter = '\t') * tab으로 구분 시
- pd.read_csv('file_path/data_name.csv', header = None) * header 가 없음
> df.columns = ['name', 'age', 'job'] > header가 추가됨

- pd.read_csv('file_path/data_name.csv', header = None, names = ['name', 'age', 'job'] ) *한번에 생성
### 조회
- df.head() # 5 개만 조회
- df.head(n) # 뒤에서 부터 n개 만큼 조회
- df.tail(n) # 뒤에서 부터 n개 만큼 조회

### Series (열이라고 생각해도 됨)
>list_tmp = [1, 2, 3]

>s1 = pd.core.series.Series( [1, 2, 3] )

>s2 = pd.core.series.Series( ['one', 'two', 'three'])

## Series로 DataFrame 만들기
pd.DataFrame(data=dict(num=s1, word=s2))

In [8]:
import pandas as pd

friend_dict_list = [
    {'name' : 'John', 'age' : 25,  'job' : 'student'},
    {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'}
]

In [11]:
df = pd.DataFrame(friend_dict_list)

In [32]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [37]:
from collections import OrderedDict

In [41]:
friend_ordered_dict = OrderedDict(
    [
        
        ('name', ['John', 'Nate']),
        ('age', [25, 30]),
        ('job', ['student', 'teacher'])
    ]

)

In [42]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [43]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [44]:
friend_list = [
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher']
]

In [45]:
column_name = ['name', 'age', 'job']

In [48]:
df = pd.DataFrame(friend_list, columns = column_name)

In [50]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [62]:
friend_list = [
    ['name', ['John', 'Nate']],
    ['age', [20, 30]],
    ['job', ['student', 'teacher']]
]

In [66]:
df = pd.DataFrame.from_dict(dict(friend_list))

In [67]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [68]:
friend = [{'name': 'John', 'age' : 20, 'job' : 'student'},
          {'name': 'Jenny', 'age' : 30, 'job' : None},
          {'name': 'Nate', 'age' : 30, 'job' : 'teacher'},
    
]
df = pd.DataFrame(friend)
df.head()

    name  age      job
0   John   20  student
1  Jenny   30     None
2   Nate   30  teacher

In [74]:
df.to_csv('friend.csv', index =False, header = False, na_rep = '-')

In [75]:
friend_list = [
    ['name', ['John', 'Jenny','Nate']],
    ['age', [20, 30, 30]],
    ['job', ['student', 'developer','teacher']]
]

In [79]:
df = pd.DataFrame.from_dict(dict(friend_list))

In [80]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [83]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [85]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [86]:
df.loc[[0, 2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

## by column condition

In [87]:
df[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [88]:
df.query('age > 25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [89]:
df[(df.age>25) & (df.name == 'Nate')]

   name  age      job
2  Nate   30  teacher

## Filter column

#### by index

In [91]:
friend_list = [
    ['John', 20, 'student'],
    ['Jenny', 30, 'developer'],
    ['Nate ', 30, 'teacher'],
]
df = pd.DataFrame.from_records(friend_list)
df.head()

       0   1          2
0   John  20    student
1  Jenny  30  developer
2  Nate   30    teacher

In [92]:
df.iloc[:,0:2] # (row, column)

       0   1
0   John  20
1  Jenny  30
2  Nate   30

In [93]:
df.iloc[0:2,0:2]

       0   1
0   John  20
1  Jenny  30

## by column name

In [96]:
df = pd.read_csv('C:/Users/kang/pandas/pandas/data/friend_list_no_head.csv', 
                header = None, names = ['name', 'age', 'job'])

In [97]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [98]:
df_filtered = df[['name', 'age']]

In [99]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [100]:
df.filter(items= ['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [102]:
df.filter(like ='a', axis = 1) # column 이름에 'a' 가 들어가 잇는 것

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [104]:
df.filter(regex='b$', axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

In [106]:
df.filter(regex='e$', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

### Raw or Column 삭제

In [126]:
df = pd.DataFrame(friend, index = ['John', 'Jenny', 'Nate'],
                 columns = ['age', 'job'])

In [129]:
df.head()

       age      job
John    20  student
Jenny   30     None
Nate    30  teacher

In [131]:
df.drop(['John', 'Nate'], inplace = True) # 변경 내용 원본에 적용

In [132]:
df

       age   job
Jenny   30  None

In [140]:
friend
df = pd.DataFrame(friend,
                 columns = ['name', 'age', 'job'])

In [137]:
df

    name  age      job
0   John   20  student
1  Jenny   30     None
2   Nate   30  teacher

In [138]:
df = df.drop(df.index[[0,2]])

In [139]:
df

    name  age   job
1  Jenny   30  None

In [143]:
df = pd.DataFrame(friend, columns = ['name', 'age', 'job'])
df

    name  age      job
0   John   20  student
1  Jenny   30     None
2   Nate   30  teacher

In [144]:
df = df[df.age > 20]

In [145]:
df

    name  age      job
1  Jenny   30     None
2   Nate   30  teacher

In [146]:
df = pd.DataFrame(friend, columns = ['name', 'age', 'job'])
df

    name  age      job
0   John   20  student
1  Jenny   30     None
2   Nate   30  teacher

In [147]:
df = df.drop('age', axis = 1)

In [148]:
df

    name      job
0   John  student
1  Jenny     None
2   Nate  teacher

In [149]:
df = pd.DataFrame(friend, columns = ['name', 'age', 'job'])
df

    name  age      job
0   John   20  student
1  Jenny   30     None
2   Nate   30  teacher

In [150]:
df.drop('age', axis = 1, inplace = True)
df

    name      job
0   John  student
1  Jenny     None
2   Nate  teacher